Repository: abdel792/askOpenRouter
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: fr

source: Chat Manager
fr: Gérer les discussion

source: C&reate a New Chat
fr: C&réer une nouvelle discussion

source: Co&ntinue a Chat
fr: Con&tinuer une discussion existante

source: &Close
fr: &Fermer

source: New Chat
fr: Nouvelle discussion

source: Continue Chat
fr: Continuer la discussion

source: OpenRouter API Key:
fr: Clé API OpenRouter :

source: Show API key
fr: Afficher la clé API

source: Display the full chat history for continuous discussions
fr: Afficher l'historique complet pour les discussions continues

source: Use all models, including paid ones.
fr: Utilisez tous les modèles, y compris les modèles payants.

source: No free model currently available.
fr: Aucun modèle gratuit disponible actuellement.

source: You said:
fr: Vous avez dit :

source: Model replied:
fr: Le modèle a répondu :

source: No free model available at the moment.
fr: Aucun modèle gratuit disponible pour le moment.

source: Model Error
fr: Erreur de modèle

source: HTTP Error
fr: Erreur HTTP

source: All free models are currently unavailable. Please try again later.
fr: Tous les modèles gratuits sont actuellement indisponibles. Veuillez réessayer plus tard.

source: Model Unavailable
fr: Modèle indisponible

source: Model Response
fr: Réponse du modèle

source: Please enter the question you want to ask OpenRouter
fr: Veuillez entrer la question que vous souhaitez poser à OpenRouter

source: You did not enter anything. Please try again.
fr: Vous n'avez rien saisi. Veuillez réessayer.

source: Input Error
fr: Erreur de saisie

source: No API key is configured. Please configure it in settings.
fr: Aucune clé API n'est configurée. Veuillez le faire dans les paramètres.

source: Configuration Error
fr: Erreur de configuration

source: Opens a dialog allowing the user to ask questions to OpenRouter
fr: Ouvre une boîte de dialogue permettant à l'utilisateur de poser des questions à OpenRouter

source: Opens the prompt to start a new OpenRouter chat.
fr: Ouvre l'invite pour démarrer une nouvelle discussion OpenRouter.

source: Opens the prompt to continue an existing OpenRouter chat.
fr: Ouvre l'invite pour continuer une discussion OpenRouter existante.

source: Opens the add-on settings panel.
fr: Ouvre le panneau des paramètres de l'extension.

source: Ask OpenRouter
fr: Demandez à OpenRouter

source: This add-on allows you to ask questions to Artificial Intelligence models available on the OpenRouter platform. You can either use automatic random selection of free models or choose a specific model manually, including paid ones. To use this add-on, you must create an account on https://openrouter.ai and generate an API key. Once configured, you can open a dialog that lets you start a new conversation or continue an existing one.
fr: Cette extension vous permet de poser des questions aux modèles d'intelligence artificielle disponibles sur la plateforme OpenRouter. Vous pouvez soit utiliser la sélection aléatoire automatique de modèles gratuits, soit choisir manuellement un modèle spécifique, incluant les modèles payants. Pour utiliser cette extension, vous devez créer un compte sur https://openrouter.ai et générer une clé API. vCette clé API devra alors être collée dans le panneau des paramètre de l'extension. Une fois l'extension configurée, vous pourrez ouvrir une boîte de dialogue qui vous permettra de démarrer une nouvelle conversation ou de poursuivre une conversation existante.

source: Changes for 20260220.0.1 Added the ability to manually choose the model you want to use from a list box in the settings panel. The model list also includes paid models for users who have OpenRouter credits.
fr: Changements pour 20260220.0.1 Ajout de la possibilité de choisir manuellement le modèle que vous souhaitez utiliser dans une zone de liste depuis le panneau des paramètres. Cette liste de modèles comprend également des modèles payants pour les utilisateurs disposant de crédits OpenRouter.
